Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GP304.h
#define _SPI2CON1_SPRE_POSITION                  0x00000002
#define _SPI2CON1_SPRE_MASK                      0x0000001C
#define _SPI2CON1_SPRE_LENGTH                    0x00000003

#define _SPI2CON1_MSTEN_POSITION                 0x00000005
#define _SPI2CON1_MSTEN_MASK                     0x00000020
#define _SPI2CON1_MSTEN_LENGTH                   0x00000001

#define _SPI2CON1_CKP_POSITION                   0x00000006
#define _SPI2CON1_CKP_MASK                       0x00000040
#define _SPI2CON1_CKP_LENGTH                     0x00000001

#define _SPI2CON1_SSEN_POSITION                  0x00000007
#define _SPI2CON1_SSEN_MASK                      0x00000080
#define _SPI2CON1_SSEN_LENGTH                    0x00000001

#define _SPI2CON1_CKE_POSITION                   0x00000008
#define _SPI2CON1_CKE_MASK                       0x00000100
#define _SPI2CON1_CKE_LENGTH                     0x00000001

#define _SPI2CON1_SMP_POSITION                   0x00000009
#define _SPI2CON1_SMP_MASK                       0x00000200
#define _SPI2CON1_SMP_LENGTH                     0x00000001

#define _SPI2CON1_MODE16_POSITION                0x0000000A
#define _SPI2CON1_MODE16_MASK                    0x00000400
#define _SPI2CON1_MODE16_LENGTH                  0x00000001

#define _SPI2CON1_DISSDO_POSITION                0x0000000B
#define _SPI2CON1_DISSDO_MASK                    0x00000800
#define _SPI2CON1_DISSDO_LENGTH                  0x00000001

#define _SPI2CON1_DISSCK_POSITION                0x0000000C
#define _SPI2CON1_DISSCK_MASK                    0x00001000
#define _SPI2CON1_DISSCK_LENGTH                  0x00000001

#define _SPI2CON1_PPRE0_POSITION                 0x00000000
#define _SPI2CON1_PPRE0_MASK                     0x00000001
#define _SPI2CON1_PPRE0_LENGTH                   0x00000001

#define _SPI2CON1_PPRE1_POSITION                 0x00000001
#define _SPI2CON1_PPRE1_MASK                     0x00000002
#define _SPI2CON1_PPRE1_LENGTH                   0x00000001

#define _SPI2CON1_SPRE0_POSITION                 0x00000002
#define _SPI2CON1_SPRE0_MASK                     0x00000004
#define _SPI2CON1_SPRE0_LENGTH                   0x00000001

#define _SPI2CON1_SPRE1_POSITION                 0x00000003
#define _SPI2CON1_SPRE1_MASK                     0x00000008
#define _SPI2CON1_SPRE1_LENGTH                   0x00000001

#define _SPI2CON1_SPRE2_POSITION                 0x00000004
#define _SPI2CON1_SPRE2_MASK                     0x00000010
#define _SPI2CON1_SPRE2_LENGTH                   0x00000001

#define _SPI2CON2_FRMDLY_POSITION                0x00000001
#define _SPI2CON2_FRMDLY_MASK                    0x00000002
#define _SPI2CON2_FRMDLY_LENGTH                  0x00000001

#define _SPI2CON2_FRMPOL_POSITION                0x0000000D
#define _SPI2CON2_FRMPOL_MASK                    0x00002000
#define _SPI2CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI2CON2_SPIFSD_POSITION                0x0000000E
#define _SPI2CON2_SPIFSD_MASK                    0x00004000
#define _SPI2CON2_SPIFSD_LENGTH                  0x00000001

#define _SPI2CON2_FRMEN_POSITION                 0x0000000F
#define _SPI2CON2_FRMEN_MASK                     0x00008000
#define _SPI2CON2_FRMEN_LENGTH                   0x00000001

#define _DCICON1_COFSM_POSITION                  0x00000000
#define _DCICON1_COFSM_MASK                      0x00000003
#define _DCICON1_COFSM_LENGTH                    0x00000002

#define _DCICON1_DJST_POSITION                   0x00000005
#define _DCICON1_DJST_MASK                       0x00000020
#define _DCICON1_DJST_LENGTH                     0x00000001

#define _DCICON1_CSDOM_POSITION                  0x00000006
#define _DCICON1_CSDOM_MASK                      0x00000040
#define _DCICON1_CSDOM_LENGTH                    0x00000001

#define _DCICON1_UNFM_POSITION                   0x00000007
#define _DCICON1_UNFM_MASK                       0x00000080
#define _DCICON1_UNFM_LENGTH                     0x00000001

#define _DCICON1_COFSD_POSITION                  0x00000008
#define _DCICON1_COFSD_MASK                      0x00000100
#define _DCICON1_COFSD_LENGTH                    0x00000001

#define _DCICON1_CSCKE_POSITION                  0x00000009
#define _DCICON1_CSCKE_MASK                      0x00000200
#define _DCICON1_CSCKE_LENGTH                    0x00000001

#define _DCICON1_CSCKD_POSITION                  0x0000000A
#define _DCICON1_CSCKD_MASK                      0x00000400
#define _DCICON1_CSCKD_LENGTH                    0x00000001

#define _DCICON1_DLOOP_POSITION                  0x0000000B
#define _DCICON1_DLOOP_MASK                      0x00000800
#define _DCICON1_DLOOP_LENGTH                    0x00000001

#define _DCICON1_DCISIDL_POSITION                0x0000000D
#define _DCICON1_DCISIDL_MASK                    0x00002000
#define _DCICON1_DCISIDL_LENGTH                  0x00000001

#define _DCICON1_DCIEN_POSITION                  0x0000000F
#define _DCICON1_DCIEN_MASK                      0x00008000
#define _DCICON1_DCIEN_LENGTH                    0x00000001

#define _DCICON1_COFSM0_POSITION                 0x00000000
#define _DCICON1_COFSM0_MASK                     0x00000001
#define _DCICON1_COFSM0_LENGTH                   0x00000001

#define _DCICON1_COFSM1_POSITION                 0x00000001
#define _DCICON1_COFSM1_MASK                     0x00000002
#define _DCICON1_COFSM1_LENGTH                   0x00000001

#define _DCICON2_WS_POSITION                     0x00000000
#define _DCICON2_WS_MASK                         0x0000000F
#define _DCICON2_WS_LENGTH                       0x00000004

#define _DCICON2_COFSG_POSITION                  0x00000005
#define _DCICON2_COFSG_MASK                      0x000001E0
#define _DCICON2_COFSG_LENGTH                    0x00000004

#define _DCICON2_BLEN_POSITION                   0x0000000A
#define _DCICON2_BLEN_MASK                       0x00000C00
#define _DCICON2_BLEN_LENGTH                     0x00000002

#define _DCICON2_WS0_POSITION                    0x00000000
#define _DCICON2_WS0_MASK                        0x00000001
#define _DCICON2_WS0_LENGTH                      0x00000001

#define _DCICON2_WS1_POSITION                    0x00000001
#define _DCICON2_WS1_MASK                        0x00000002
#define _DCICON2_WS1_LENGTH                      0x00000001

#define _DCICON2_WS2_POSITION                    0x00000002
#define _DCICON2_WS2_MASK                        0x00000004
#define _DCICON2_WS2_LENGTH                      0x00000001

